'''Маємо набір монет [50, 25, 10, 5, 2, 1].
Уявіть, що ви розробляєте систему для касового апарату, яка повинна визначити оптимальний спосіб видачі решти покупцеві.

Вам необхідно написати дві функції для касової системи, яка видає решту покупцеві:

Функція жадібного алгоритму find_coins_greedy. Ця функція повинна приймати суму, яку потрібно видати покупцеві, 
і повертати словник із кількістю монет кожного номіналу, що використовуються для формування цієї суми. 
Наприклад, для суми 113 це буде словник {50: 2, 10: 1, 2: 1, 1: 1}. 
Алгоритм повинен бути жадібним, тобто спочатку вибирати найбільш доступні номінали монет.'''

def find_coins_greedy(amount):
    coins = [50, 25, 10, 5, 2, 1]
    result = {}
    
    for coin in coins:
        if amount >= coin:
            count = amount // coin
            amount -= coin * count
            result[coin] = count

    return result

# # Приклад використання
print(find_coins_greedy(113))  # {50: 2, 10: 1, 2: 1, 1: 1}


'''Функція динамічного програмування find_min_coins. 
Ця функція також повинна приймати суму для видачі решти, 
але використовувати метод динамічного програмування, щоб знайти мінімальну кількість монет,
необхідних для формування цієї суми. Функція повинна повертати словник із номіналами монет та їх кількістю для досягнення заданої суми найефективнішим способом.
Наприклад, для суми 113 це буде словник {1: 1, 2: 1, 10: 1, 50: 2}'''

def find_min_coins(amount):
    coins = [50, 25, 10, 5, 2, 1]
    dp = [float('inf')] * (amount + 1)
    dp[0] = 0
    coin_used = [0] * (amount + 1)
    
    for coin in coins:
        for x in range(coin, amount + 1):
            if dp[x - coin] + 1 < dp[x]:
                dp[x] = dp[x - coin] + 1
                coin_used[x] = coin

    if dp[amount] == float('inf'):
        return {}
    
    result = {}
    while amount > 0:
        coin = coin_used[amount]
        if coin in result:
            result[coin] += 1
        else:
            result[coin] = 1
        amount -= coin

    return result

# Приклад використання
print(find_min_coins(113))  # {50: 2, 10: 1, 2: 1, 1: 1}

